DataProcessors/ОтправкаСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаСообщения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СообщенияЧерновик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СообщенияЧерновик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЧерновика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОтправкаСообщения/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьКартинку(Команда)

	ЗегрузитьКартинку();
	
КонецПроцедуры

 &НаКлиенте
Асинх Процедура ЗегрузитьКартинку()
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения|*.jpg;*.png;*.jpeg"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если ПомещенныйФайл <> Неопределено И Не ПомещенныйФайл.ПомещениеФайлаОтменено Тогда 
		ИмяФайла = ПомещенныйФайл.СсылкаНаФайл.Имя;
		ЗаписатьФайлКартинкиЧерновикНаСервере(ПомещенныйФайл.Адрес, ИмяФайла, ТекстСообщения);
		Оповестить("Добавлена картинка сообщения");
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаписатьФайлКартинкиЧерновикНаСервере(АдресВХ, ИмяФайла, ТекстСообщения)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	МЗ = РегистрыСведений.СообщенияЧерновик.СоздатьМенеджерЗаписи();
	
	МЗ.Пользователь 	= Пользователь;
	МЗ.ДатаЧерновика	= ТекущаяДата();
	МЗ.ТекстСообщения 	= ТекстСообщения;
	МЗ.ИмяФайла 		= ИмяФайла;
	МЗ.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	
	МЗ.Записать();
	
	
КонецФункции 


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Добавлена картинка сообщения" Тогда
		//Если Параметр = Объект.Ссылка Тогда
			ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки",0.5,Истина);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗагрузкиКартинки() Экспорт

	ОбновитьКартинки();	
	Элементы.АдресКартинки.Обновить();

КонецПроцедуры // ПослеЗагрузкиКартинки()

 
&НаСервере
Процедура ОбновитьКартинки()	
	КлючКартинки = РегистрыСведений.СообщенияЧерновик.СоздатьКлючЗаписи(Новый Структура("Пользователь", ПараметрыСеанса.ТекущийПользователь));
	АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
КонецПроцедуры
